---
kind: type
id: T:Autodesk.Revit.DB.ExternallyTaggedNonBRepUsage
source: html/e1c38aeb-52d1-69cc-8601-3f9c2637b4da.htm
---
# Autodesk.Revit.DB.ExternallyTaggedNonBRepUsage

The ways in which an ExternallyTaggedNonBRep can be used in Revit.

## Syntax (C#)
```csharp
public enum ExternallyTaggedNonBRepUsage
```